-------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------
--ahsin做的：主线剧情任务进度查询奖励系统
--版本：20241124
--本lua必须运行在m佬的新框架下
--首发论坛 www.cnmlb.com 获取最新版本

--由于功能比较丰富，免费分享归免费过来b站点个赞、一键三连不过分吧？
--https://space.bilibili.com/21127109
--qq群：85199642

--本lua只支持cgmsv+新框架，不然100%跑不起来
-------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------

--模块类
local event_awardModule = ModuleBase:createModule('event_award')

--加载模块钩子
function event_awardModule:onLoad()
	self:logInfo('load')
	event_npc = self:NPC_createNormal('主線劇情獎勵',14586,{x=226,y=83,mapType=0,map=1000,direction=4})--endevent npc
	Char.SetData(event_npc,CONST.对象_ENEMY_PetFlg+2,0)--可穿透体
	self:NPC_regTalkedEvent(event_npc,Func.bind(self.face2npc,self))--面向npc触发
	self:NPC_regWindowTalkedEvent(event_npc,Func.bind(self.click,self))--npc窗口按钮触发
end

local on = '$5已完成$0'--可diy
local off = '$8未完成$0'--可diy
local nowpage = {}--玩家翻页记录表
--★★★感谢超爱大佬统计提供的endevent大全excel★★★
local end_events = {--主线剧情任务列表
--[1]endeventid[2]文字介绍[3]奖励介绍[4]奖励道具itemid（-1无奖励）[5]数量（无奖励时数字无效，随便填）
{0,'國王的信','任務幣×10',70075,10},--示例，拿到國王的信，獎勵1鉆，獎勵道具超過1個的盡量可疊加，否則後期判斷背包空格容易出錯
{1,'誓言的念珠','任務幣×2',70075,2},
{2,'新手獎勵','任務幣×1',70075,1},
{3,'希望的蠟燭-露比','任務幣×10',70075,10},
{5,'開啟者','任務幣×10',70075,10},
{6,'魔大-醉鬼','任務幣×2',70075,2},
{7,'少女的正義1',' ',-1,1},
{8,'少女的正義2',' ',-1,1},
{9,'少女的正義3',' ',-1,1},
{10,'少女的正義4',' ',-1,1},
{11,'少女的正義5',' ',-1,1},
{12,'少女的正義6',' ',-1,1},
{13,'少女的正義7',' ',-1,1},
{14,'少女的正義8',' ',-1,1},
{15,'少女的正義9',' ',-1,1},
{16,'少女的正義10',' ',-1,1},
{17,'探索遺跡的人',' ',-1,1},
{18,'冰雪的牢城-佛利波羅','鑽石×20',70076,20},
{19,'風鳴之塔-阿卡斯','鑽石×20',70076,20},
{21,'六曜之塔-李貝留斯','鑽石×20',70076,20},
{22,'王宮食堂-不合格廚師',' ',-1,1},--疑似可反復接取，不建議給獎勵
{23,'王宮食堂-敏腕廚師',' ',-1,1},
{24,'王宮食堂-極上廚師',' ',-1,1},
{25,'王宮食堂-究極廚師',' ',-1,1},
{26,'地下競技場-三冠王者','鑽石×20',70076,10},
{28,'閃亮之心','任務幣×5',70075,5},
{29,'光輝的白銀之魂','任務幣×5',70075,5},
{30,'迷路之穴',' ',-1,1},
{31,'仙人就職1',' ',-1,1},
{32,'仙人就職2',' ',-1,1},
{33,'仙人就職3',' ',-1,1},
{34,'仙人就職4',' ',-1,1},
{35,'再生花園1',' ',-1,1},--示例，給寵物的話請做成蛋
{36,'再生花園2',' ',-1,1},
{37,'再生花園3',' ',-1,1},
{38,'白龍城-引導者','鑽石×20',70076,20},
{39,'黑龍城-閃耀者','鑽石×20',70076,20},
{45,'崩落的坑道',' ',-1,1},
{46,'競技場大迷宮1',' ',-1,1},
{47,'競技場大迷宮2',' ',-1,1},
{48,'舞者就職','Ａ◇艾爾薇(巫)',900206,1},
{50,'艾爾巴第八等勛章','Ａ◇卡西歐(兵)',900202,1},--可反復接取，不建議給獎勵
{51,'艾爾巴第七等勛章',' ',-1,1},
{52,'艾爾巴第六等勛章',' ',-1,1},
{53,'艾爾巴第五等勛章',' ',-1,1},
{54,'艾爾巴第四等勛章',' ',-1,1},
{55,'艾爾巴第三等勛章',' ',-1,1},
{56,'艾爾巴第二等勛章',' ',-1,1},
{57,'艾爾巴第一等勛章',' ',-1,1},
{58,'蘭國第八等勛章','Ａ◇卡西歐(兵)',900202,1},
{59,'蘭國第七等勛章',' ',-1,1},
{60,'蘭國第六等勛章',' ',-1,1},
{61,'蘭國第五等勛章',' ',-1,1},
{62,'蘭國第四等勛章',' ',-1,1},
{63,'蘭國第三等勛章',' ',-1,1},
{64,'蘭國第二等勛章',' ',-1,1},
{65,'蘭國第一等勛章',' ',-1,1},
{66,'蘭國-遺產',' ',-1,1},
{67,'偵探就職1','任務幣×1',70075,1},
{68,'偵探就職2','任務幣×1',70075,1},
{69,'偵探就職3','任務幣×1',70075,1},
{70,'偵探就職4','任務幣×1',70075,1},
{71,'偵探就職5','任務幣×1',70075,1},
{72,'偵探就職6','任務幣×1',70075,1},
{73,'偵探就職7','任務幣×1',70075,1},
{74,'偵探就職8','任務幣×1',70075,1},
{75,'偵探就職9','任務幣×1',70075,1},
{76,'盗贼就職1','任務幣×5',70075,5},
{77,'盗贼就職2','任務幣×10',70075,10},
{78,'獅鷲分布進度','任務幣×1',70075,1},
{79,'獅鷲分布進度','任務幣×1',70075,1},
{80,'獅鷲分布進度','任務幣×1',70075,1},
{81,'獅鷲分布進度','任務幣×1',70075,1},
{82,'獅鷲分布進度','任務幣×1',70075,1},
{83,'獅鷲分布進度','任務幣×1',70075,1},
{84,'獅鷲分布進度','任務幣×1',70075,1},
{85,'獅鷲分布進度','任務幣×1',70075,1},
{86,'獅鷲分布進度','任務幣×1',70075,1},
{87,'仙人就職1','任務幣×5',70075,5},
{88,'仙人就職2','任務幣×10',70075,10},
{89,'路霸阿德基姆','Ａ◇伊萊歐斯(傳)',900203,1},
{90,'誓言之花-4轉','鑽石×10',70076,10},--可轉職，不建議給獎勵
{91,'詛咒的迷宮-3轉','Ａ◇瑟菲亞(咒)',900205,1},
{92,'挑戰神獸-2轉','Ａ◇維克薩斯(法)',900204,1},
{93,'樹精長老-1轉','Ａ◇艾瑟利昂(劍)',900200,1},
{94,'伊爾傳送','任務幣×1',70075,1},
{95,'聖拉魯卡傳送','任務幣×1',70075,1},
{96,'亞留特傳送','任務幣×1',70075,1},
{97,'維諾亞傳送','任務幣×1',70075,1},
{98,'奇利傳送','任務幣×1',70075,1},
{99,'加納傳送','任務幣×1',70075,1},
{100,'傑諾瓦傳送','任務幣×1',70075,1},
{101,'蒂娜傳送','任務幣×1',70075,1},
{102,'阿巴尼斯傳送','任務幣×1',70075,1},
{103,'哥拉爾定居',' ',-1,1},--定居可變，不建議給獎勵
{104,'月亮俱樂部-董事長','任務幣×500',70075,500},
{105,'森羅萬象','鑽石×200',70076,200},
{106,'情人節-愛吃甜的人',' ',-1,1},
{107,'情人節-愛吃辣的人',' ',-1,1},
{108,'艾國七等支線','任務幣×50',70075,50},
{109,'蘭國七等支線','任務幣×50',70075,50},
{110,'坎那貝拉村傳送','任務幣×5',70075,5},
{111,'蘭7其他進度',' ',-1,1},
{112,'蘭7其他進度',' ',-1,1},
{113,'蘭7其他進度',' ',-1,1},
{114,'蘭6其他進度',' ',-1,1},
{115,'蘭5其他進度',' ',-1,1},
{116,'蘭5其他進度',' ',-1,1},
{117,'蘭4其他進度',' ',-1,1},
{118,'蘭4其他進度',' ',-1,1},
{119,'蘭x其他進度',' ',-1,1},
{120,'蘭x其他進度',' ',-1,1},
{121,'蘭x其他進度',' ',-1,1},
{122,'蘭x其他進度',' ',-1,1},
{123,'蘭x其他進度',' ',-1,1},
{124,'蘭x其他進度',' ',-1,1},
{125,'月亮俱樂部-遊手好閑的人','任務幣×10',70075,10},
{126,'浪漫主義者1',' ',-1,1},
{127,'浪漫主義者2',' ',-1,1},
{128,'蘭6其他進度',' ',-1,1},
{129,'蘭6其他進度',' ',-1,1},
{130,'帕魯凱斯的亡靈','任務幣×10',70075,10},
{131,'帕魯凱斯的亡靈-魔鬼剋星','鑽石×20',70076,20},
{132,'龍之拯救者-龍鱗','任務幣×10',70075,10},
{133,'龍之拯救者','任務幣×10',70075,10},
{134,'龍之拯救者-歸途白銀騎士','鑽石×20',70076,20},
{135,'米諾基亞傳送','任務幣×10',70075,10},
{136,'五等追加','任務幣×20',70075,20},
{137,'盲目之龍艾汀-北國行者','鑽石×10',70076,10},
{138,'白銀之騎士豪爾-北國行者','鑽石×10',70076,10},
{139,'盲目之龍艾汀-北國行者','鑽石×20',70076,20},
{140,'賽格梅特之魂-綠龍-解放者','鑽石×5',70076,5},
{141,'龍之沙漏-紅龍-解放者','鑽石×5',70076,5},
{142,'龍之沙漏-藍龍-解放者','鑽石×5',70076,5},
{143,'賽格梅特之魂-解放者','鑽石×5',70076,5},
{144,'1000萬在線紀念-法蘭城市民',' ',-1,1},
{145,'蘭三追加','任務幣×20',70075,20},
{146,'蘭三追加','任務幣×20',70075,20},
{147,'蘭二追加','任務幣×20',70075,20},
{150,'地獄祭-迷宮冒險野郎',' ',-1,1},
{152,'天界騎士','鑽石×5',70076,5},
{153,'星詠歌姬','鑽石×5',70076,5},
{154,'追尋神祇回憶的人',' ',-1,1},
{155,'漢米頓村傳送','任務幣×20',70075,20},
{156,'魔弓傳奇1','任務幣×10',70075,10},
{157,'魔弓傳奇2','任務幣×20',70075,20},
{159,'砂之解放者',' ',-1,1},
{160,'光之冒險者',' ',-1,1},
{161,'飄風之蘭-亞紀傳送','任務幣×10',70075,10},
{162,'醉鬼中的霸主',' ',-1,1},
{163,'秘密組織的邀請',' ',-1,1},
{164,'四聖獸回憶',' ',-1,1},
{165,'十周年的感動',' ',-1,1},
{166,'公主傳說-秋楓第五勛章',' ',-1,1},
{167,'公主傳說-春櫻第五勛章',' ',-1,1},
{168,'公主傳說-秋楓第四勛章',' ',-1,1},
{169,'公主傳說-春櫻第四勛章',' ',-1,1},
{170,'公主傳說-秋楓第三勛章',' ',-1,1},
{171,'公主傳說-春櫻第三勛章',' ',-1,1},
{172,'公主傳說-秋楓第二勛章',' ',-1,1},
{173,'公主傳說-春櫻第二勛章',' ',-1,1},
{174,'公主傳說-秋楓第一勛章',' ',-1,1},
{175,'公主傳說-春櫻第一勛章',' ',-1,1},
{176,'聖鳥之謎',' ',-1,1},
{177,'贖罪的亡靈章',' ',-1,1},
{178,'小島之謎',' ',-1,1},
{179,'地獄的回響',' ',-1,1},
{180,'死神的降臨',' ',-1,1},
{181,'死與新生',' ',-1,1},
{200,'魔界風水師',' ',-1,1},
{202,'上流社會人士',' ',-1,1},
{202,'不屈不撓的愛',' ',-1,1},
{203,'連勝強者',' ',-1,1},
{204,'連戰之王',' ',-1,1},
{205,'勇氣的串連',' ',-1,1},
{206,'托爾丘的記憶-記憶接觸者','鑽石×5',70076,5},
{207,'記憶的接觸者-天界的改革者','鑽石×15',70076,15},
{208,'小雞阿哲-守護者',' ',-1,1},
{209,'英勇戰士',' ',-1,1},
{210,'被奪走的貢品',' ',-1,1},
{212,'泰格利的煩惱',' ',-1,1},
{213,'蒂娜沈船遺跡',' ',-1,1},
{241,'尼維爾海村傳送','任務幣×10',70075,10},
{242,'克瑞村傳送','任務幣×10',70075,10},
{243,'摩頓村傳送','任務幣×10',70075,10},
{244,'雷歐娜村傳送','任務幣×10',70075,10},
--以此类推
}

function event_awardModule:face2npc(npc,player)--面向npc触发
	nowpage[player] = 0
	show_window(npc,player)
	return 0
end

function event_awardModule:click(npc,player,seq,sel,data)--窗口中点击触发
	--print('seq：' .. seq)
	--print('sel：' .. sel)
	--print('data：' .. data)
	data = tonumber(data)
	if seq == 0 then
		if sel == 32 then--下一页
			nowpage[player] = nowpage[player] + 1
			show_window(npc,player)
		elseif sel == 16 then--上一页
			nowpage[player] = nowpage[player] - 1
			show_window(npc,player)
		elseif sel == 1 then--领奖
			giveitem(player)--给奖励
			--NLG.ShowWindowTalked(player,npc,CONST.窗口_信息框,1,1,'@c\\n\\n\\n\\n制作中，尽请期待...')
		end
	end
	if seq == 444 and sel == 16 then--错误页返回
		nowpage[player] = 0
		show_window(npc,player)
	end
end

function show_window(npc,player)--弹窗
	--[1]endeventid[2]文字介绍[3]奖励介绍[4]奖励道具itemid（-1无奖励）[5]数量（无奖励时数字无效，随便填）
	local maxpage = math.ceil(#end_events/20)
	local neirong = '                      【主線劇情 - 查詢】\\n'
	neirong = neirong .. '                            $4< ' .. nowpage[player]+1 .. '/' .. maxpage .. ' >$0\\n'
	for i = 1,20 do
		i = i + nowpage[player]*20
		if i > #end_events then
			break
		end
		neirong = neirong --[[.. i .. '.']] .. left(end_events[i][2],28) .. left('$1' .. end_events[i][3] .. '$0',21)
		.. isend(player,end_events[i][1]) .. '  ' ..isawarded(player,i) .. '\\n'
	end
	if nowpage[player] == 0 then--第一页
		neirong = neirong .. '            $2▼▼▼$0 點擊【$4確 定$0】 領取獎勵'
		NLG.ShowWindowTalked(player,npc,CONST.窗口_巨信息框,35,0,neirong)
	elseif nowpage[player] == maxpage-1 then--最后一页
		local less = 20 - (#end_events - ((maxpage-1)*20))--剩余行数匹配
		--print('maxpage：'..maxpage..'，#end_events：'..#end_events..'，剩余行计算：'..less)
		for i = 1,less do
			neirong = neirong .. '\\n'
		end
		neirong = neirong .. '            $2▼▼▼$0 點擊【$4確 定$0】 領取獎勵'
		NLG.ShowWindowTalked(player,npc,CONST.窗口_巨信息框,19,0,neirong)
	else--中间页
		neirong = neirong .. '         $2▼▼▼$0 點擊【$4確 定$0】 領取獎勵'
		NLG.ShowWindowTalked(player,npc,CONST.窗口_巨信息框,51,0,neirong)
	end
end

function isend(player,endeventid)--检查主线状态
	if Char.EndEvent(player,endeventid) == 1 then
		return on
	else
		return off
	end
end

function isawarded(player,i)--是否可领取奖励
	if end_events[i][4] >= 0 then--有设置奖励
		if Char.GetExtData(player,'endevent'..end_events[i][1]) == 1 then--0=未领取，1=已领取
			return '$1已領取$0'
		else
			if Char.EndEvent(player,end_events[i][1]) == 1 then
				return '$4未領取$0'
			elseif Char.EndEvent(player,end_events[i][1]) == 0 then
				return '$8不可領$0'
			end
		end
	else--没设置奖励
		return '$7無獎品$0'
	end
end

function giveitem(player)--给奖励
--[1]endeventid[2]文字介绍[3]奖励介绍[4]奖励道具itemid（-1无奖励）[5]数量（无奖励时数字无效，随便填）
local count = 0
	for i = 1,#end_events do
		--print('i = '..i..'，'..tostring('endevent'..end_events[i][1])..' = '..Char.EndEvent(player,end_events[i][1]))
		if Char.GetExtData(player,tostring('endevent'..end_events[i][1])) ~= 1 and Char.EndEvent(player,end_events[i][1]) == 1 then--0=未领取，1=已领取
			if end_events[i][4] > -1 then--判断是否给道具
				if Char.ItemSlot(player)+8 >= Char.GetData(player,CONST.CHAR_道具栏) then--道具满了
					NLG.ShowWindowTalked(player,event_npc,CONST.窗口_信息框,18,444,'@c\\n\\n\\n\\n你的東西太多了。')
					Char.SaveToDb(player)
					return
				else
					Char.SetExtData(player,tostring('endevent'..end_events[i][1]),1)--标记为已领取
					Char.GiveItem(player,end_events[i][4],end_events[i][5])--给道具
					count = count + 1
				end
			end
		end
	end
	if count == 0 then
		NLG.ShowWindowTalked(player,event_npc,CONST.窗口_信息框,18,444,'@c\\n\\n\\n\\你沒有可領取的獎勵。')
	end
	Char.SaveToDb(player)
end

function left(str,len)--居左
    local char = ' ' -- 填充空格
	if len-#str >= 0 then
		local padding = string.rep(char,len-#str)
		return str..padding
	else
		local text = '$4<太长请修改>$0'
		local padding = string.rep(char,len-#text)
		return text..padding
	end
end

--卸载模块钩子
function event_awardModule:onUnload()
	self:logInfo('unload')
end

return event_awardModule

