-- 升级多一点bp
local function moreBP(n)
  return function(charIndex) 
    local originPoint = Char.GetData(charIndex,CONST.对象_升级点)
    Char.SetData(charIndex,CONST.对象_升级点,originPoint+n)
  end
end
-- id 7 的雇佣函数
local function recruit(charIndex)
  local charLevel = Char.GetData(charIndex,CONST.对象_等级)
  if charLevel<10 then
    NLG.Say(charIndex,-1,"等級到達10再來吧。",CONST.颜色_红色,0)
    return false
  end
  return true
end

-- 其他属性定义 
-- 参数： 必杀，反击，命中，闪躲，抗毒，抗睡，抗石，抗醉，抗乱，抗忘
local function  modValue(critical,counter,hitrate,avoid,poison,sleep,stone,drunk,confused,insomnia)
  return {
    [tostring(CONST.对象_必杀)]=critical or 0,
    [tostring(CONST.对象_反击)]=counter or 0,
    [tostring(CONST.对象_命中)]=hitrate or 0,
    [tostring(CONST.对象_闪躲)]=avoid or 0, 
    [tostring(CONST.对象_抗毒)]=poison or 0,
    [tostring(CONST.对象_抗睡)]=sleep or 0,
    [tostring(CONST.对象_抗石)]=stone or 0,
    [tostring(CONST.对象_抗醉)]=drunk or 0,
    [tostring(CONST.对象_抗乱)]=confused or 0,
    [tostring(CONST.对象_抗忘)]=insomnia or 0,
  }
end


local heroes = {
  -- {id，名字,职业名称，职业id，职类id, 职业阶层, 图档id，等级，体力，力量，强度，速度，魔法，未加点，稀有度,升级回调函数，雇佣回调函数,人物初始ai,宠物初始ai,分类,其他属性,初始宠物enemyId，
                                                                                                -- 初始装备(头|身|左手|右手|腿|首饰1|首饰2|水晶)}
  -- R 0, "R", nil, nil   
  -- SR 20, "SR", moreBP(1), nil 
  -- SSR 40, "SSR", moreBP(2), nil 
  -- UR 80, "UR", moreBP(4), nil
  -- R宠物 螳螂(120) 321|水龙(125) 722
  -- SR宠物 地狱妖犬(125) 34| 烈风之刃604 | 改造僵尸(125) 2049 改造烈风哥布林(127) 2063 | 火焰舞者(130) 102270 | 
  -- SSR宠物 改造地狱妖犬(135) 2065 | 果冻史莱姆(135) 10008 | 杀龙之刃(136) 10101 | 爱丝波波(135) 103008 | 铁狮(139) 303800 | 恶魔统领(135) 60028 | 樱花螳螂(133) 60041 | 
  -- UR宠物 芙蕾雅番茄妖精(165) 832074 | 雪蕾洁(170) 103106 | 露比(195) 103108 | 阿鲁巴斯(195) 103109 | 超梦地甲(150) 60109 | 蕾姆(150) 900258 | 贞德(160) 900259 | 秋兔克隆体(170) 900260 | 

  --{1, "御建雷","劍士",24,20,3,105034,1,5,15,0,10,0,0,"R",nil,nil,{20},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{2, "雷恩","騎士",34,30,3,105517,1,5,15,0,10,0,0,"R",nil,nil,{40},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{3, "暗精靈","弓箭手",44,40,3,106551,1,5,15,0,10,0,0,"R",nil,nil,{50},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{4, "刃牙","格鬥士",144,140,3,106044,1,5,15,0,10,0,0,"R",nil,nil,{100},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{5, "琳琳","傳教士",64,60,3,105297,1,5,0,0,10,15,0,"R",nil,nil,{10},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{6, "吉拉","劍士",14,10,3,105321,1,5,15,0,10,0,0,"R",nil,nil,{30},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  --{7, "小紅","魔法師",74,70,3,106266,1,5,0,0,10,15,0,"R",nil,nil,{60},{240},1,nil,{120, 722},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {1, "時雨","破鋒者",1101,1100,1,106628,1,4,10,5,6,3,0,"R",moreBP(2),nil,{200},{240},1,nil,{314, 321},{nil,nil,nil,nil,nil,nil,nil,9209}},
  {2, "扎瑞","逐風者",1111,1110,1,106551,1,4,10,5,6,3,0,"R",moreBP(2),nil,{201},{240},1,nil,{314, 321},{nil,nil,nil,2000,nil,nil,nil,9227}},
  {3, "小紅","星語者",1121,1120,1,106604,1,5,3,4,6,10,0,"R",moreBP(2),nil,{202},{240},1,nil,{321, 722},{nil,nil,nil,nil,nil,nil,nil,9218}},
  {4, "刃牙","演武者",1131,1130,1,106452,1,6,10,4,5,3,0,"R",moreBP(2),nil,{203},{240},1,nil,{321, 722},{nil,nil,nil,nil,nil,nil,nil,9236}},
  {5,"艾瑟利昂","刃影行者",1201,1200,3,105503,40,35,125,46,55,25,0,"A",moreBP(3),nil,{204},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9226}},
  {6,"蕾薇安","夜隱射手",1211,1210,3,104455,40,35,125,26,75,25,0,"A",moreBP(3),nil,{205},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,2000,nil,nil,nil,nil,9237}},
  {7,"卡西歐","遠星行者",1221,1220,3,104501,40,46,125,35,45,35,0,"A",moreBP(3),nil,{206},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9228}},
  {8,"伊萊歐斯","信仰行者",1231,1230,3,105510,40,86,15,25,35,125,0,"A",moreBP(3),nil,{207},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9235}},
  {9,"維克薩斯","虛空賢者",1241,1240,3,104481,40,25,15,35,86,125,0,"A",moreBP(3),nil,{208},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9219}},
  {10,"瑟菲亞","秘法詠者",1251,1250,3,104416,40,35,15,25,86,125,0,"A",moreBP(3),nil,{209},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9210}},
  {11,"艾爾薇","元素織匠",1261,1260,3,105529,40,86,15,25,55,105,0,"A",moreBP(3),nil,{210},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9226}},
  {12,"雷因哈特","戰魂行者",1271,1270,3,104462,40,66,125,35,45,15,0,"A",moreBP(3),nil,{211},{240},3,modValue(10,10,10,10,10,10,10,10,10,10),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9217}},
  -- S級
  {13,"蕾希夜弦","無聲星落",1301,1300,5,130037,70,65,220,83,99,49,0,"S",moreBP(4),nil,{300},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,2000,nil,nil,nil,nil,9222}},
  {14,"卡爾薇娜","紅蓮爆擊",1311,1310,5,130035,70,99,220,83,65,49,0,"S",moreBP(4),nil,{301},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9214}},
  {15,"伊莉菲絲","虛無寂滅",1321,1320,5,130038,70,65,49,83,99,220,0,"S",moreBP(4),nil,{302},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9223}},
  {16,"瑟爾維亞","裂天狂襲",1331,1330,5,130036,70,83,220,65,99,49,0,"S",moreBP(4),nil,{303},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9213}},
  {17,"碇真嗣","EVA初號機",1341,1340,5,130148,90,85,240,103,119,69,0,"S",moreBP(4),nil,{304},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9212}},
  {18,"綾波零","EVA零號機",1351,1350,5,130149,90,119,240,103,85,69,0,"S",moreBP(4),nil,{305},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9217}},
  {19,"明日香","EVA貳號機",1361,1360,5,130150,90,103,240,119,85,69,0,"S",moreBP(4),nil,{306},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9226}},
  {20,"安茲·烏爾·恭","無上至尊",1371,1370,5,130151,90,103,69,85,119,240,0,"S",moreBP(4),nil,{307},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9238}},
  {21,"雅兒貝德","守護者總管",1381,1380,5,130152,90,103,69,85,119,240,0,"S",moreBP(4),nil,{308},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9213}},
  {22,"夏提雅","最強守護者",1391,1390,5,130153,90,103,240,85,119,69,0,"S",moreBP(4),nil,{309},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9223}},
  {23,"Saber","從者Saber",1401,1400,5,130154,90,103,240,119,85,69,0,"S",moreBP(4),nil,{310},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9234}},
  {24,"Archer","從者Archer",1411,1410,5,130155,90,93,240,85,129,69,0,"S",moreBP(4),nil,{311},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,2000,nil,nil,nil,nil,9225}},
  {25,"Lancer","從者Lancer",1421,1420,5,130156,90,93,240,95,119,69,0,"S",moreBP(4),nil,{312},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9216}},
  {26,"八神庵","八神流古武術",1431,1430,5,130157,90,85,240,103,119,69,0,"S",moreBP(4),nil,{313},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9227}},
  {27,"草薙京","草薙流古武術",1441,1440,5,130158,90,103,240,85,119,69,0,"S",moreBP(4),nil,{314},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9209}},
  {28,"利姆路","聖魔混世皇",1451,1450,5,130159,90,93,240,85,119,79,0,"S",moreBP(4),nil,{315},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9202}},
  {29,"蜜莉姆","破壞的暴君",1461,1460,5,130160,90,93,240,85,129,69,0,"S",moreBP(4),nil,{316},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9201}},
  {30,"紅丸","赫怒王",1471,1470,5,130161,90,69,83,105,119,240,0,"S",moreBP(4),nil,{317},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9203}},
  {31,"朱菜","神導巫女",1481,1480,5,130162,90,119,69,85,109,240,0,"S",moreBP(4),nil,{318},{240},5,modValue(30,30,30,30,30,30,30,30,30,30),{0, 0},{nil,nil,nil,nil,nil,nil,nil,9204}},
  -- TODO: 巫,咒,宠,炸,忍,兵,舞
  {101,"露娜","戰斧鬥士",24,20,3,106264,1,5,15,0,10,0,20,"SR",moreBP(1),nil,{20},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {102,"凱恩","騎士",34,30,3,106127,1,5,15,0,10,0,20,"SR",moreBP(1),nil,{40},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {103,"七海","弓箭手",44,40,3,105252,1,5,15,0,10,0,20,"SR",moreBP(1),nil,{50},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {104,"星夜","格鬥士",144,140,3,106033,1,5,15,0,10,0,20,"SR",moreBP(1),nil,{600},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {105,"蕾米","傳教士",64,60,3,105295,1,5,0,0,10,15,20,"SR",moreBP(1),nil,{10},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {106,"妮莎","劍士",14,10,3,106377,1,5,15,0,10,0,20,"SR",moreBP(1),nil,{30},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {107,"梅林","魔法師",74,70,3,106327,1,5,0,0,10,15,20,"SR",moreBP(1),nil,{60},{240},3,nil,{2063, 2049},{nil,nil,nil,nil,nil,nil,nil,nil}},
  -- TODO: 巫,咒,宠,炸,忍,兵,舞
  {201,"莉娜","戰斧鬥士",25,20,4,106600,1,5,15,0,10,0,40,"SSR",moreBP(2),nil,{20},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {202,"伊吹","騎士",35,30,4,106705,1,5,15,0,10,0,40,"SSR",moreBP(2),nil,{40},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {203,"星織","弓箭手",45,40,4,106626,1,5,15,0,10,0,40,"SSR",moreBP(2),nil,{50},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {204,"星白","格鬥士",145,140,4,118351,1,5,15,0,10,0,40,"SSR",moreBP(2),nil,{100},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {205,"愛莉","傳教士",65,60,4,105788,1,5,0,0,10,15,40,"SSR",moreBP(2),nil,{10},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {206,"夜鶯","劍士",15,10,4,160023,1,5,15,0,10,0,40,"SSR",moreBP(2),nil,{30},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {207,"莎夏","魔法師",75,70,4,105335,1,5,0,0,10,15,40,"SSR",moreBP(2),nil,{60},{240},5,modValue(10,10,10,10,10,10,10,10,10,10),{60041, 10101},{nil,nil,nil,nil,nil,nil,nil,nil}},
  -- TODO: 巫,咒,宠,炸,忍,兵,舞
  {901,"伊芙","戰斧鬥士",26,20,5,160044,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{20},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {902,"悠悠","騎士",36,30,5,105777,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{40},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {903,"鷺鷺","弓箭手",46,40,5,160003,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{50},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {904,"蘿娜","格鬥士",146,140,5,118032,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{100},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {905,"秋菟","傳教士",66,60,5,106792,1,5,0,0,10,15,80,"UR",moreBP(4),nil,{10},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {906,"吹雪","劍士",16,10,5,105685,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{30, 5100, 5110},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {907,"莉莉","魔法師",76,70,5,118347,1,5,0,0,10,15,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {908,"蕾兵","士兵",56,50,5,105998,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {910,"蕾巫","巫師",136,130,5,118347,1,5,0,0,10,15,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {911,"蕾咒","咒術師",86,80,5,118347,1,5,0,0,10,15,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {912,"蕾舞","舞者",166,160,5,118347,1,5,0,0,10,15,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {913,"蕾寵","寵物師",96,90,5,105998,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {914,"蕾忍","忍者",156,150,5,105998,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
  {915,"蕾爆","爆彈師",1006,1000,5,105998,1,5,15,0,10,0,80,"UR",moreBP(4),nil,{60},{240},9,modValue(30,30,30,30,30,30,30,30,30,30),{60109, 900258},{nil,nil,nil,nil,nil,nil,nil,nil}},
}


return heroes


